### Terraform Plan for `dev` Environment 📖

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
awscc_s3_bucket.this: Refreshing state... [id=terraform-demo-dev-us-east-1]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=697621333100]
awscc_s3_bucket_policy.this: Refreshing state... [id=terraform-demo-dev-us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # awscc_s3_bucket.that will be created
  + resource "awscc_s3_bucket" "that" {
      + accelerate_configuration           = (known after apply)
      + access_control                     = (known after apply)
      + analytics_configurations           = (known after apply)
      + arn                                = (known after apply)
      + bucket_encryption                  = (known after apply)
      + bucket_name                        = "terraform-demo2-dev-us-east-1"
      + cors_configuration                 = (known after apply)
      + domain_name                        = (known after apply)
      + dual_stack_domain_name             = (known after apply)
      + id                                 = (known after apply)
      + intelligent_tiering_configurations = (known after apply)
      + inventory_configurations           = (known after apply)
      + lifecycle_configuration            = (known after apply)
      + logging_configuration              = (known after apply)
      + metrics_configurations             = (known after apply)
      + notification_configuration         = (known after apply)
      + object_lock_configuration          = (known after apply)
      + object_lock_enabled                = (known after apply)
      + ownership_controls                 = (known after apply)
      + public_access_block_configuration  = (known after apply)
      + regional_domain_name               = (known after apply)
      + replication_configuration          = (known after apply)
      + tags                               = [
          + {
              + key   = "Modified By"
              + value = "AWSCC"
            },
        ]
      + versioning_configuration           = (known after apply)
      + website_configuration              = (known after apply)
      + website_url                        = (known after apply)
    }

  # awscc_s3_bucket.this will be updated in-place
  ~ resource "awscc_s3_bucket" "this" {
      + accelerate_configuration           = (known after apply)
      + access_control                     = (known after apply)
      + analytics_configurations           = (known after apply)
      + cors_configuration                 = (known after apply)
        id                                 = "terraform-demo-dev-us-east-1"
      + intelligent_tiering_configurations = (known after apply)
      + inventory_configurations           = (known after apply)
      + lifecycle_configuration            = (known after apply)
      + logging_configuration              = (known after apply)
      + metrics_configurations             = (known after apply)
      + notification_configuration         = (known after apply)
      + object_lock_configuration          = (known after apply)
      + object_lock_enabled                = (known after apply)
      + replication_configuration          = (known after apply)
        tags                               = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
        ]
      + versioning_configuration           = (known after apply)
      + website_configuration              = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # awscc_s3_bucket_policy.this will be updated in-place
  ~ resource "awscc_s3_bucket_policy" "this" {
        id              = "terraform-demo-dev-us-east-1"
      ~ policy_document = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "s3:GetObject" -> [
                          + "s3:GetObject",
                        ]
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::697621333100:root" -> [
                              + "697621333100",
                            ]
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.json

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.json"

```

</details>

*Pushed by: @quixoticmonk, Action: `pull_request`*